Repository: piyumi27/Aayu
Catalog: lib/l10n/app_*.arb
Languages: si, ta

# appTitle
source: Aayu
si: ආයු
ta: ஆயு

# _comment_general
source: === GENERAL ===
si: === සාමාන්‍ය ===
ta: === பொதுவானது ===

source: Loading...
si: පූරණය වෙමින්...
ta: ஏற்றுகிறது...

source: Error
si: දෝෂය
ta: பிழை

source: Success
si: සාර්ථකයි
ta: வெற்றி

source: Cancel
si: අවලංගු කරන්න
ta: ரத்து செய்

source: Save
si: සුරකින්න
ta: சேமி

source: Delete
si: මකන්න
ta: நீக்கு

source: Edit
si: සංස්කරණය
ta: திருத்து

source: Add
si: එකතු කරන්න
ta: சேர்

source: Close
si: වසන්න
ta: மூடு

source: Back
si: ආපසු
ta: பின்

source: Next
si: ඊළඟ
ta: அடுத்து

source: Done
si: අවසන්
ta: முடிந்தது

source: Yes
si: ඔව්
ta: ஆம்

source: No
si: නැහැ
ta: இல்லை

source: OK
si: හරි
ta: சரி

# _comment_navigation
source: === NAVIGATION ===
si: === යාත්‍රණ ===
ta: === வழிசெலுத்தல் ===

# homeTab
source: Home
si: මුල් පිටුව
ta: முகப்பு

# growthTab
source: Growth
si: වර්ධනය
ta: வளர்ச்சி

# vaccinesTab
source: Vaccines
si: එන්නත්
ta: தடுப்பூசிகள்

# learnTab
source: Learn
si: ඉගෙනගන්න
ta: கற்றுக்கொள்

# profileTab
source: Profile
si: පැතිකඩ
ta: சுயவிவரம்

# _comment_child
source: === CHILD MANAGEMENT ===
si: === දරු කළමනාකරණය ===
ta: === குழந்தை மேலாண்மை ===

source: Add Child
si: දරුවා එකතු කරන්න
ta: குழந்தையை சேர்

source: Child Name
si: දරුවාගේ නම
ta: குழந்தையின் பெயர்

source: Birth Date
si: උපන් දිනය
ta: பிறந்த தேதி

source: Gender
si: ස්ත්‍රී පුරුෂ භාවය
ta: பாலினம்

source: Male
si: පුරුෂ
ta: ஆண்

source: Female
si: ස්ත්‍රී
ta: பெண்

# birthWeight
source: Birth Weight (kg)
si: උපන් බර (කි.ග්‍රා.)
ta: பிறந்த எடை (கிலோ)

# birthHeight
source: Birth Height (cm)
si: උපන් උස (සෙ.මී.)
ta: பிறந்த உயரம் (செ.மீ.)

# _comment_growth
source: === GROWTH TRACKING ===
si: === වර්ධන ලුහුබැඳීම ===
ta: === வளர்ச்சி கண்காணிப்பு ===

source: Add Measurement
si: මැනීම එකතු කරන්න
ta: அளவீட்டை சேர்

# currentWeight
source: Current Weight (kg)
si: වත්මන් බර (කි.ග්‍රා.)
ta: தற்போதைய எடை (கிலோ)

# currentHeight
source: Current Height (cm)
si: වත්මන් උස (සෙ.මී.)
ta: தற்போதைய உயரம் (செ.மீ.)

source: Measurement Date
si: මැනීම් දිනය
ta: அளவீட்டு தேதி

source: Weight for Age
si: වයස අනුව බර
ta: வயதுக்கேற்ற எடை

source: Height for Age
si: වයස අනුව උස
ta: வயதுக்கேற்ற உயரம்

source: Weight for Height
si: උස අනුව බර
ta: உயரத்துக்கேற்ற எடை

source: BMI for Age
si: වයස අනුව BMI
ta: வயதுக்கேற்ற BMI

# _comment_vaccines
source: === VACCINATION ===
si: === එන්නත් කිරීම ===
ta: === தடுப்பூசி ===

source: Vaccination Schedule
si: එන්නත් කිරීමේ කාලසටහන
ta: தடுப்பூசி அட்டவணை

# scheduleTab
source: Schedule
si: කාලසටහන
ta: அட்டவணை

# givenTab
source: Given
si: දී ඇත
ta: கொடுத்தது

# upcomingTab
source: Upcoming
si: ඉදිරියට
ta: வரவிருக்கும்

source: Vaccine Given
si: එන්නත දී ඇත
ta: தடுப்பூசி கொடுக்கப்பட்டது

source: Schedule Measurement
si: මැනීම් කාලසටහන
ta: அளவீட்டு அட்டவணை

source: Schedule Vaccine
si: එන්නත් කාලසටහන
ta: தடுப்பூசி அட்டவணை

source: View Schedule
si: කාලසටහන බලන්න
ta: அட்டவணையைப் பார்

# location
source: Location/Hospital
si: ස්ථානය/රෝහල
ta: இடம்/மருத்துவமனை

source: Doctor Name
si: වෛද්‍යවරයාගේ නම
ta: மருத்துவரின் பெயர்

# batchNumber
source: Batch Number (Optional)
si: කණ්ඩායම් අංකය (විකල්ප)
ta: தொகுதி எண் (விருப்பம்)

# notes
source: Notes (Optional)
si: සටහන් (විකල්ප)
ta: குறிப்புகள் (விருப்பம்)

# sideEffectsNoted
source: Side Effects Noted (Optional)
si: පාර්ශ්ව ප්‍රතිඵල සටහන් (විකල්ප)
ta: பக்கவிளைவுகள் குறிப்பிட்டது (விருப்பம்)

source: Overdue Vaccines
si: ප්‍රමාද වූ එන්නත්
ta: தாமதமான தடுப்பூசிகள்

source: Upcoming Vaccines
si: ඉදිරි එන්නත්
ta: வரவிருக்கும் தடுப்பூசிகள்

# _comment_medications
source: === MEDICATIONS ===
si: === ඖෂධ ===
ta: === மருந்துகள் ===

# medicationsAndSupplements
source: Medications & Supplements
si: ඖෂධ සහ අතිරේක
ta: மருந்துகள் & சப்ளிமெண்ட்ஸ்

# todayTab
source: Today
si: අද
ta: இன்று

# activeTab
source: Active
si: ක්‍රියාකාරී
ta: செயலில்

# historyTab
source: History
si: ඉතිහාසය
ta: வரலாறு

# statsTab
source: Stats
si: සංඛ්‍යාලේඛන
ta: புள்ளிவிவரங்கள்

# supplementsAndVitamins
source: Supplements & Vitamins
si: අතිරේක සහ විටමින්
ta: சப்ளிமெண்ட்ஸ் & வைட்டமின்கள்

source: Medications
si: ඖෂධ
ta: மருந்துகள்

source: Overdue Medications
si: ප්‍රමාද වූ ඖෂධ
ta: தாமதமான மருந்துகள்

# upcomingMedications
source: Upcoming (Next 2 Hours)
si: ඉදිරි (පැය 2 ක් තුළ)
ta: வரவிருக்கும் (அடுத்த 2 மணிநேரம்)

source: Today's Schedule
si: අදගේ කාලසටහන
ta: இன்றைய அட்டவணை

source: Take
si: ගන්න
ta: எடு

source: Skip
si: මඟ හරින්න
ta: தவிர்

source: Take Now
si: දැන් ගන්න
ta: இப்போது எடு

source: Take Medication
si: ඖෂධය ගන්න
ta: மருந்து எடு

source: Skip Dose
si: මාත්‍රාව මඟ හරින්න
ta: டோஸ் தவிர்

source: Add Medication
si: ඖෂධය එකතු කරන්න
ta: மருந்து சேர்

source: Medication Name
si: ඖෂධයේ නම
ta: மருந்தின் பெயர்

source: Dosage
si: මාත්‍රාව
ta: டோஸ்

source: Frequency
si: වාර ගණන
ta: அடிக்கடி

source: Start Date
si: ආරම්භක දිනය
ta: தொடக்க தேதி

# endDate
source: End Date (Optional)
si: අවසාන දිනය (විකල්ප)
ta: முடிவு தேதி (விருப்பம்)

# _comment_notifications
source: === NOTIFICATIONS ===
si: === දැනුම්දීම් ===
ta: === அறிவிப்புகள் ===

source: Notifications
si: දැනුම්දීම්
ta: அறிவிப்புகள்

source: Health Alerts
si: සෞඛ්‍ය අනතුරු ඇඟවීම්
ta: சுகாதார எச்சரிக்கைகள்

source: Reminders
si: සිහිකැඳවීම්
ta: நினைவூட்டல்கள்

source: Tips & Guidance
si: උපදෙස් සහ මගපෙන්වීම
ta: குறிப்புகள் & வழிகாட்டுதல்

source: System Updates
si: පද්ධති යාවත්කාලීන
ta: சிஸ்டம் புதுப்பிப்புகள்

# measurementGapTitle
source: Measurement Gap Alert
si: මැනීම් පරතරය අනතුරු ඇඟවීම
ta: அளவீட்டு இடைவெளி எச்சரிக்கை

# measurementGapContent
source: It's been {days} days since the last measurement for {childName}. Regular monitoring is important for tracking growth progress.
si: {childName}ගේ අවසාන මැනීමට දින {days}ක් ගතව ඇත. වර්ධන ප්‍රගතිය නිරීක්ෂණය සඳහා නිතිපතා මැනීම වැදගත්ය.
ta: {childName}க்கான கடைசி அளவீட்டுக்கு {days} நாட்கள் ஆகிவிட்டன. வளர்ச்சி முன்னேற்றத்தை கண்காணிக்க வழக்கமான கண்காணிப்பு முக்கியம்.

# nutritionConcernTitle
source: Nutrition Concern
si: පෝෂණ සැලකිල්ල
ta: ஊட்டச்சத்து கவலை

# nutritionConcernContent
source: BMI trend analysis shows concerns for {childName}. Consider consulting with your PHM for guidance.
si: BMI ප්‍රවණතා විශ්ලේෂණය {childName} සඳහා සැලකිල්ල පෙන්නුම් කරයි. මගපෙන්වීම සඳහා ඔබගේ PHM සමඟ සාකච්ඡා කිරීම සලකා බලන්න.
ta: BMI போக்கு பகுப்பாய்வு {childName}க்கு கவலைகளைக் காட்டுகிறது. வழிகாட்டுதலுக்காக உங்கள் PHM உடன் ஆலோசிக்கவும்.

# growthStagnationTitle
source: Growth Monitoring Alert
si: වර්ධන නිරීක්ෂණ අනතුරු ඇඟවීම
ta: வளர்ச்சி கண்காணிப்பு எச்சரிக்கை

# growthStagnationContent
source: Growth measurements for {childName} show stagnation. Please schedule a PHM visit for evaluation.
si: {childName}ගේ වර්ධන මැනීම් මන්දගාමී බව පෙන්වයි. ඇගයීම සඳහා PHM සංචාරයක් සැලසුම් කරන්න.
ta: {childName}க்கான வளர்ச்சி அளவீடுகள் தேங்கி நிற்பதைக் காட்டுகின்றன. மதிப்பீட்டுக்காக PHM வருகையை திட்டமிடவும்.

# measurementReminderTitle
source: Measurement Reminder
si: මැනීම් සිහිකැඳවීම
ta: அளவீட்டு நினைவூட்டல்

# measurementReminderContent
source: Time for {childName}'s regular growth measurement. Consistent tracking helps monitor healthy development.
si: {childName}ගේ නිත්‍ය වර්ධන මැනීමේ කාලයයි. අඛණ්ඩ ලුහුබැඳීම සෞඛ්‍ය සම්පන්න වර්ධනය නිරීක්ෂණයට උපකාරී වේ.
ta: {childName}க்கான வழக்கமான வளர்ச்சி அளவீட்டின் நேரம். தொடர்ச்சியான கண்காணிப்பு ஆரோக்கியமான வளர்ச்சியை கண்காணிக்க உதவுகிறது.

# vaccineOverdueTitle
source: Vaccine Overdue
si: එන්නත ප්‍රමාද වී ඇත
ta: தடுப்பூசி தாமதம்

# vaccineOverdueContent
source: {vaccineName} ({vaccineLocal}) is overdue for {childName} by {monthsOverdue} months. Please schedule vaccination.
si: {vaccineName} ({vaccineLocal}) {childName} සඳහා මාස {monthsOverdue}කින් ප්‍රමාද වී ඇත. කරුණාකර එන්නත් කිරීම සැලසුම් කරන්න.
ta: {vaccineName} ({vaccineLocal}) {childName}க்கு {monthsOverdue} மாதங்களாக தாமதமாகிறது. தயவுசெய்து தடுப்பூசியை திட்டமிடவும்.

# vaccineUpcomingTitle
source: Upcoming Vaccination
si: ඉදිරි එන්නත් කිරීම
ta: வரவிருக்கும் தடுப்பூசி

# vaccineUpcomingContent
source: {vaccineName} ({vaccineLocal}) is due for {childName} in {dueInMonths} months.
si: {vaccineName} ({vaccineLocal}) {childName} සඳහා මාස {dueInMonths}කින් ගත යුතුය.
ta: {vaccineName} ({vaccineLocal}) {childName}க்கு {dueInMonths} மாதங்களில் தேவை.

# medicationOverdueTitle
source: Medication Overdue
si: ඖෂධය ප්‍රමාද වී ඇත
ta: மருந்து தாமதம்

# medicationOverdueContent
source: {medicationName} ({dosage}) is overdue for {childName} by {hoursOverdue} hours.
si: {medicationName} ({dosage}) {childName} සඳහා පැය {hoursOverdue}කින් ප්‍රමාද වී ඇත.
ta: {medicationName} ({dosage}) {childName}க்கு {hoursOverdue} மணிநேரங்களாக தாமதமாகிறது.

# medicationUpcomingTitle
source: Medication Reminder
si: ඖෂධ සිහිකැඳවීම
ta: மருந்து நினைவூட்டல்

# medicationUpcomingContent
source: {medicationName} ({dosage}) is due for {childName} in {hoursUntil} hours.
si: {medicationName} ({dosage}) {childName} සඳහා පැය {hoursUntil}කින් ගත යුතුය.
ta: {medicationName} ({dosage}) {childName}க்கு {hoursUntil} மணிநேரங்களில் தேவை.

# medicationAdherenceTitle
source: Medication Adherence
si: ඖෂධ පිළිපැදීම
ta: மருந்து பின்பற்றுதல்

# medicationAdherenceContent
source: Adherence for {medicationName} is {adherencePercentage}% for {childName}. Consider setting more reminders.
si: {childName} සඳහා {medicationName} පිළිපැදීම {adherencePercentage}% යි. වැඩි සිහිකැඳවීම් සැලසීම සලකා බලන්න.
ta: {childName}க்கான {medicationName} பின்பற்றுதல் {adherencePercentage}% ஆகும். மேலும் நினைவூட்டல்களை அமைப்பது பற்றி பரிசீலிக்கவும்.

# _comment_learn
source: === LEARN SECTION ===
si: === ඉගෙන ගැනීමේ කොටස ===
ta: === கற்றல் பிரிவு ===

# featuredTab
source: Featured
si: විශේෂාංග
ta: சிறப்பு

# categoriesTab
source: Categories
si: කාණ්ඩ
ta: வகைகள்

# recentTab
source: Recent
si: මෑත
ta: சமீபத்திய

source: Search articles...
si: ලිපි සොයන්න...
ta: கட்டுரைகளைத் தேடு...

source: Read More
si: තව කියවන්න
ta: மேலும் படிக்க

source: Related Articles
si: සම්බන්ධ ලිපි
ta: தொடர்புடைய கட்டுரைகள்

# _comment_profile
source: === PROFILE ===
si: === පැතිකඩ ===
ta: === சுயவிவரம் ===

source: Settings
si: සැකසීම්
ta: அமைப்புகள்

source: Language
si: භාෂාව
ta: மொழி

source: About
si: පිළිබඳව
ta: பற்றி

# help
source: Help & Support
si: උදව් සහ සහාය
ta: உதவி & ஆதரவு

source: Logout
si: ප්‍රවිශ්ටයෙන් ඉවත් වන්න
ta: வெளியேறு

# _comment_settings
source: === SETTINGS ===
si: === සැකසීම් ===
ta: === அமைப்புகள் ===

source: App Settings
si: යෙදුම් සැකසීම්
ta: ஆப் அமைப்புகள்

source: Language Settings
si: භාෂා සැකසීම්
ta: மொழி அமைப்புகள்

source: Notification Settings
si: දැනුම්දීම් සැකසීම්
ta: அறிவிப்பு அமைப்புகள்

source: Data Management
si: දත්ත කළමනාකරණය
ta: தரவு மேலாண்மை

source: Export Data
si: දත්ත නිර්යාත කරන්න
ta: தரவை ஏற்றுமதி செய்

source: Import Data
si: දත්ත ආයාත කරන්න
ta: தரவை இறக்குமதி செய்

source: Delete All Data
si: සියලු දත්ත මකන්න
ta: அனைத்து தரவையும் நீக்கு

# _comment_about
source: === ABOUT ===
si: === පිළිබඳව ===
ta: === பற்றி ===

source: About Aayu
si: ආයු පිළිබඳව
ta: ஆயு பற்றி

source: Version
si: අනුවාදය
ta: பதிப்பு

source: Developer
si: සංවර්ධකයා
ta: டெவலப்பர்

# founder
source: Founder & Co-founder
si: ආරම්භකයා සහ සම-ආරම්භකයා
ta: நிறுவனர் & இணை நிறுவனர்

source: Contact Us
si: අප සමඟ සම්බන්ධ වන්න
ta: எங்களைத் தொடர்பு கொள்ளுங்கள்

source: Privacy Policy
si: පෞද්ගලිකත්ව ප්‍රතිපත්තිය
ta: தனியுரிமைக் கொள்கை

source: Terms of Service
si: සේවා නියමයන්
ta: சேவை நிபந்தனைகள்
